{
  "blogs": [
    {
      "title": "React is a library",
      "body": "Why is React a library and not a framework?\n eact was made to build full-fledged web applications. As a result, it's often compared with other tools that developers use to build apps, like Angular, Vue, and Svelte.\n React is written in JavaScript and is used to make better JavaScript applications. We refer to React specifically as a library. \n ut what makes React a library and not a framework? \n he reason becomes clear when we look at other similar tools that are used to create complete web applications. \n et's look at a project like Angular, which shares the same purpose as React (to create single-page web apps). What sets it apart is the fact that when you set up an Angular project, it is bootstrapped with nearly every single thing that you'll need to make a complete, large-scale app. \n Frameworks are a common choice for companies and anyone looking to make enterprise JavaScript applications, because they include resources that a large-scale application would likely need. This includes built-in tools for common tasks like creating forms, running automated tests, making network requests, and much more. \n in short, everything that you need to make a complete application is included in your Angular project when it's generated. But that is not the case with React.",
      "auther": "Reed Barger",
      "id": 1
    },
    {
      "title": "Is Einstein the smartest person that ever lived?",
      "body": "Einstein was born in Ulm, Germany, on March 14, 1879. His family moved to Munich shortly thereafter, and to Italy after that. Einstein studied in Switzerland and became a Swiss citizen in 1905, the year he received his diploma.\n it was his incomparable understanding of science and his remarkable theories of how physics works in the real world that set him apart from other scientists of his time. Many today still marvel at his Theory of Relativity.\n till the question. Albert Einstein: is he the smartest person who ever lived?\n urprisingly, no - not when it comes to raw IQ. His intelligence quotient was estimated at between 160 and 190, and while that is amazing by everyday standards, it's not the highest ever recorded.\n hat title goes to an American, born in 1898, William James Sidis. Sidis, who graduated from Harvard University at age 16, had an IQ estimated at an astounding 250 to 300. He enrolled in Harvard's law school at the tender age of 18.\n ot far behind Sidia is Terence Tao, with an IQ of between 220 and 230. Tao's IQ was estimated at between 220 and 230 by the Davidson Institute, a Nevada school specializing in the development of gifted children. Terence began solving basic arithmetic problems when he was only two years old. He was born in 1975 in Adelaide, Australia.\n  number of sources place Christopher Hirata, a Japanese-American astrophysicist next on the list. He became the youngest American to win the top medal at the 1996 International Physics Olympiad in 1996 at the age of 13. Christopher, with an IQ estimated at 225, completed college-level courses in calculus and physics when most of his contemporaries were in the seventh grade.\n t the number four spot is Korean civil engineer Kim Ung-Yong. He started speaking and reading Korean and even some foreign languages at six months, and at 14 he was solving complicated calculus problems on a Japanese TV program. His IQ is said to be 210.\n arry Gasparov, regarded as the world's top chess player is next, with an IQ estimated at 190. He is a native of Azerbaijan, a middle-eastern country located between Russia and Iran. He once played chess against a world team of some 50,000 contestants from more than 75 countries.\n he first woman on the list of brightest people ever is Marilyn Vos Savant, with an IQ veried at 190. Born in St. Louis in 1946, she is an author, playwright and columnist. She was listed in the Guinness Book of World Records as the woman with the highest recorded IQ.\n eonardo DaVinci is next (IQ 180-190, followed by Hungarian-born Judit Polgar at 170. A master chess player at an early age, she has defeated Garry Gasparov, and is known as the top women's chess player.\n he author of the Theory of Relativity actually finishes ninth, with his IQ of 160-190. Physicist and cosmologist Stephen Hawking rounds out the top ten list with an IQ estimated at 160.\n ne member of the list might have to be replaced one day soon, though. A boy born four years ago in the United Kingdom is estimated to have the same Intelligence Quotient as Einstein. If someone asks this about Albert Einstein: “Is he the smartest person who ever lived?” The answer is “no.” Nonetheless, he is by far the most well-known.",
      "auther": "B. David Warner",
      "id": 2
    },
    {
      "title": "What is Cyber Security?",
      "body": "Cyber security is the practice of defending computers, servers, mobile devices, electronic systems, networks, and data from malicious attacks. It's also known as information technology security or electronic information security. The term applies in a variety of contexts, from business to mobile computing, and can be divided into a few common categories.\n  Network security is the practice of securing a computer network from intruders, whether targeted attackers or opportunistic malware.\n  Application security focuses on keeping software and devices free of threats. A compromised application could provide access to the data its designed to protect. Successful security begins in the design stage, well before a program or device is deployed.\n  Information security protects the integrity and privacy of data, both in storage and in transit.\n  Operational security includes the processes and decisions for handling and protecting data assets. The permissions users have when accessing a network and the procedures that determine how and where data may be stored or shared all fall under this umbrella.\n  Disaster recovery and business continuity define how an organization responds to a cyber-security incident or any other event that causes the loss of operations or data. Disaster recovery policies dictate how the organization restores its operations and information to return to the same operating capacity as before the event. Business continuity is the plan the organization falls back on while trying to operate without certain resources.\n End-user education addresses the most unpredictable cyber-security factor: people. Anyone can accidentally introduce a virus to an otherwise secure system by failing to follow good security practices. Teaching users to delete suspicious email attachments, not plug in unidentified USB drives, and various other important lessons is vital for the security of any organization.",
      "auther": "anonymous",
      "id": 3
    },
    {
      "title": "Is a college degree needed to work in tech?",
      "body": "When you have an open position, it's important to accurately identify the qualifications needed for the role. However, sometimes employers inflate those qualifications in the hopes of finding top talent, a practice often referred to as credential inflation. Below are some of the pitfalls of this approach and some guidelines for avoiding credential inflation.\n What could go wrong?\n If your educational requirements exceed those needed for the position, it may be difficult to fill the role and you may be overlooking otherwise qualified candidates. For example, not every job requires a bachelor's degree, but many employers include it as a qualification regardless of the position. \n Inflating educational requirements may also undermine the value of on-the-job experience and valuable skills that can only be developed outside of the classroom. Further, the practice may lead to discrimination claims if it excludes certain protected groups who tend to graduate college at lower rates. The costs of finding and employing individuals with a college degree also tend to be higher.\n Conclusion:\n Make sure the job qualifications you require match the skills needed on the job and that all your screening and selection practices comply with federal, state, and local nondiscrimination laws.",
      "auther": "anonymous",
      "id": 4
    }
  ]
}